////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 寰肩姯妗€閾楀盎?patcher_x86.dll 
// 鐤ｈ€х棨鑰辩枺?寮? 鐤嬮捄閽跨湇(寰ㄨ€ц睔铦?
// 鍣旇澗鐦冭?闀冲檾? 鎷庣梻鐪?绂诲盎瑗︾?(baratorch), e-mail: baratorch@yandex.ru
// 绾涚棬?鐤卞毌妗ゅ湁姊?榫涚弨閾欑棨蹇倐顜?韬炶?(LoHook) 閾楅鑰?闀辩帋妗佽€卞扛蹇勭， ?Berserker (妗?ERA)
////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 蹇槂? 4.2

////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// 铚楀鍔虫壈.
//
// ! 寰肩姯妗€铦堣祬 闀抽們閾栬湠鎬嗭５寮?
//  - 绠愰捄鐫?绠滄妗锋閽煎洍鐫?椴ョ湚鐤ｈ厯鐝欏縿鐪勵帓 
//    妗ц€辩椉鎴剧湚?娼嗭５ 绡戣湠鐪嶆€?闀熻澕褰??韬炶?
//    ?瑙?椴ヨ劜蹇?闀抽捊鐤ｇ?
//  - 婕曢暠鑵犳牘鍜徃顜?妗ц€辩椉鎴剧湚? 婊傜帋鑰ㄥ睈鐘宝 娼嗘¨ 閾掕婕??瓒旈换椴?
//    瑙愰暔鐥碱搥绨?瑙??瑙愮棫灏昏澖顜?闀ョ柋鐪嶈€?閾掕婕?jmp ?call c 
//    閾楃湇鑰旇潏鏈︾湇?鍣ょ柋瑗﹂波褰?
// ! 寰肩姯妗€铦堣祬 闀辩幃閾嶏５寮?
//  - 绡戣湠纾€嗘鍥?璧?闀抽摉铻?铚??鑰犻搱鐫?闀熻澕?
//  - 绡戣湠纾€嗘鍥?鎭硅€﹁绠撮捈绀ゆ伖?韬炶, 鐜庢埦顙戯５ 閾曟　妗у毌顝割帓 瓒旈换椴??
//    ?椴ヨ劜蹇?瑙愭捍 纾?鐤嬮搳, 绀?鐜庣姺?椤??鐤辨报鑰辩枺?闀抽摓缇艰€︾枺,
//    鑰鳖憮? ?蹇哥幃鐤ｈ潏 ?閾曟　妗у毌顝割帠 瑙?
//  - 绡戣湠纾€嗘鍥?鎭硅€﹁绠撮捈绀ゆ伖?韬炶 閽挎¨ 纾?婕閾?
//    绀?妗夎顠? ?婕曢暠鑵狅５铮?闀?顟涢搸 瓒旈换椴ㄩ搻鍤徃閾栬灟 韬炶?
//    绡戣湠鐪嶆€嗗睓鐫?鐤ｇ潈顗?闀辫€犻們绀ゆ硱
//  - 绡戣湠纾€嗘鍥?榫涚弨閾欑棨蹇倐顜?韬炶 ?鎭硅€﹁绠撮捈绀ゆ伖?婕曡€辩閾??
//    鐤辨报鑰辩枺?闀抽摓缇艰€︾枺, 鑰鳖憮? 鐜庤潏鐥遍搸?瑙愭酱 ?鍣ょ柋鑰?蹇哥幃鐤ｈ湠 ?瑙?
//  - 閾楁埦?铻?鑶荤姺?闀熻澕 ?韬? 绡戣湠鐪嶆€嗗睓鐫??闀辩顙?顟涢搵 寰肩姯妗€铦堣.
//  - 绠哥，铻?鐜庢捍杞宠湲閽煎洍 鑵?閾掔柋婧磋劜鐪勵帠 绁? 妗夐暠鏈︾彏顡€鏍?寰肩姯妗€铦堢墻
//  - 绠哥，铻?璧呰?绁?(妗夐暠鏈︾彏顡€鏍?寰肩姯妗€铦堢墻) 绡戣湠鐪嶅郡?閾掔柋婧磋劜鐪勵帠 闀熻澕/韬?
//  - 闀卞楹掕灟 闀辫厾顜?婕曡€辩 瑙?鎬﹀睈 闀熻澕鍥?韬炶祬? 绡戣湠鐪嶆€嗗睓鐫?妗?婕妗?绁涙紩?
//    ?闀辩顙?顟涢搵 寰肩姯妗€铦堣

#define CALL_13(return_type, call_type, address, a1, a2, a3, a4, a5, a6, a7, a8, a9, a10, a11, a12, a13) \
 ((return_type (call_type *)(_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_))(address))((_dword_)(a1),(_dword_)(a2),(_dword_)(a3),(_dword_)(a4),(_dword_)(a5),(_dword_)(a6),(_dword_)(a7),(_dword_)(a8),(_dword_)(a9),(_dword_)(a10),(_dword_)(a11),(_dword_)(a12),(_dword_)(a13))
#define CALL_14(return_type, call_type, address, a1, a2, a3, a4, a5, a6, a7, a8, a9, a10, a11, a12, a13, a14) \
 ((return_type (call_type *)(_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_))(address))((_dword_)(a1),(_dword_)(a2),(_dword_)(a3),(_dword_)(a4),(_dword_)(a5),(_dword_)(a6),(_dword_)(a7),(_dword_)(a8),(_dword_)(a9),(_dword_)(a10),(_dword_)(a11),(_dword_)(a12),(_dword_)(a13),(_dword_)(a14))
#define CALL_15(return_type, call_type, address, a1, a2, a3, a4, a5, a6, a7, a8, a9, a10, a11, a12, a13, a14, a15) \
 ((return_type (call_type *)(_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_))(address))((_dword_)(a1),(_dword_)(a2),(_dword_)(a3),(_dword_)(a4),(_dword_)(a5),(_dword_)(a6),(_dword_)(a7),(_dword_)(a8),(_dword_)(a9),(_dword_)(a10),(_dword_)(a11),(_dword_)(a12),(_dword_)(a13),(_dword_)(a14),(_dword_)(a15))
#define CALL_16(return_type, call_type, address, a1, a2, a3, a4, a5, a6, a7, a8, a9, a10, a11, a12, a13, a14, a15, a16) \
 ((return_type (call_type *)(_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_))(address))((_dword_)(a1),(_dword_)(a2),(_dword_)(a3),(_dword_)(a4),(_dword_)(a5),(_dword_)(a6),(_dword_)(a7),(_dword_)(a8),(_dword_)(a9),(_dword_)(a10),(_dword_)(a11),(_dword_)(a12),(_dword_)(a13),(_dword_)(a14),(_dword_)(a15),(_dword_)(a16))
#define CALL_17(return_type, call_type, address, a1, a2, a3, a4, a5, a6, a7, a8, a9, a10, a11, a12, a13, a14, a15, a16, a17) \
 ((return_type (call_type *)(_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_,_dword_))(address))((_dword_)(a1),(_dword_)(a2),(_dword_)(a3),(_dword_)(a4),(_dword_)(a5),(_dword_)(a6),(_dword_)(a7),(_dword_)(a8),(_dword_)(a9),(_dword_)(a10),(_dword_)(a11),(_dword_)(a12),(_dword_)(a13),(_dword_)(a14),(_dword_)(a15),(_dword_)(a16),(_dword_)(a17))

#define CALL_VA(return_type, adress, a1, ...) \
 ((return_type (__cdecl *)(_dword_, ...))(adress))((_dword_)(a1), __VA_ARGS__)


// _bool_ - 4-?寰夎降閽碱帠 鑵╂报楹囪€滄牆 铚? 璧?BOOL ?Win32 API
// 缇艰厯 閾熷睓?鐜庤簠楹囪澃铮? 绁涢獡?鐜庢埦榫涜灟 纾?BOOL 妗?閽跨湇寰夎降閽碱帠 bool 纾暢妗佸宝
#define _bool_ __int32

// 鎬?鍣ょ柋瑗??楝ｈ€?绠ㄥ櫥鍥瑰挮褰?閾掔柋婧磋劜鐫?顟涙 铚╅暠?
// 缇艰厯 蹇?绠愰捄绀?闀?婕閾? 绁涢┙铦?鐜庢埦榫涜灟 _ptr_ 纾?鑶荤姺?婕閾?铚? void* 妗?int 纾暢妗佸宝
typedef _dword_ _ptr_;



// 蹇?鎬﹁壌 鑰辩椉鐗濈鍦??妗ц潏鐥垮綐瑗?寰肩姯妗€铦堣 婕曡厛鐪?鐚佽灟 鎭圭枺蹇鍥楁、 - 4 寰夎降?
#pragma pack(push, 4)


//铚?"闀ョ柋鎴剧渼?", 妗夐暠鏈︾彏寮? 娼嗭５ 蹇哥幃鐤ｎ嫅灞愵帰 鎴捐澗婧ф増 Patcher::VarInit ?Patcher::VarFind 鐝ュ湝灞欐牆.
class Variable
{
public:
	// 蹇哥幃鐤ｎ嫅寮?鐝ュ湝灞欐、 '闀ョ柋鎴剧渼閾? (闀辫澗瑙愬鲸鐝欓暉鑰ラ搫 閽虹枺顙栭緵?
	virtual _dword_ __stdcall GetValue() = 0;
	// 绡戣湠纾€嗘鍣?鐝ュ湝灞欐、 '闀ョ柋鎴剧渼閾? (闀辫澗瑙愬鲸鐝欓暉鑰ラ搫 閽虹枺顙栭緵?
	virtual void __stdcall SetValue(_dword_ value) = 0;
	// 蹇哥幃鐤ｎ嫅寮?绠ㄥ櫥鍥瑰挮?纾?鐝ュ湝灞欐、 (閽虹枺顙栭緵??鐝ュ湝灞欐９ 楹囩柋?绠ㄥ櫥鍥瑰挮?绀ら暠铦捐寰ㄧ彊闀熻€?
	virtual _dword_* __stdcall GetPValue() = 0;
};

// 铚?'鐤辨报鑰?缍﹀殕閽?, 鐤ｇ張灞?- 32 寰艰湠 
// 妗夐暠鏈︾彏寮? ?HookContext
struct FlagsRegister
{
	_dword_ CF			: 1; //0
	_dword_ reserved_1	: 1; //1
	_dword_ PF			: 1; //2
	_dword_ reserved_3	: 1; //3
	_dword_ AF			: 1; //4
	_dword_ reserved_5	: 1; //5
	_dword_ ZF			: 1; //6
	_dword_ SF			: 1; //7
	_dword_ TF			: 1; //8
	_dword_ IF			: 1; //9
	_dword_ DF			: 1; //10
	_dword_ OF			: 1; //11
	_dword_ IOPL		: 2; //12-13
	_dword_ NT			: 1; //14
	_dword_ reserved_15	: 1; //15
	_dword_ RF			: 1; //16
	_dword_ VM			: 1; //17
	_dword_ AC			: 1; //18
	_dword_ VIF			: 1; //19
	_dword_ VIP			: 1; //20
	_dword_ ID			: 1; //21
	_dword_ reserved_22	: 1; //22
	_dword_ reserved_23	: 1; //23
	_dword_ reserved_24	: 1; //24
	_dword_ reserved_25	: 1; //25
	_dword_ reserved_26	: 1; //26
	_dword_ reserved_27	: 1; //27
	_dword_ reserved_28	: 1; //28
	_dword_ reserved_29	: 1; //29
	_dword_ reserved_30	: 1; //30
	_dword_ reserved_31	: 1; //31
};

// 缇婄椉鐗濈?HookContext
// 妗夐暠鏈︾彏寮? ?瓒旈换椴５?鑰╁檶閾楀檾顗?闀?LoHook 韬炵墻
struct HookContext
{
 int eax; //鐤辨报鑰?EAX, 榛╁睓妗?妗ゆ埦绀ら緵?
 int ecx; //鐤辨报鑰?ECX, 榛╁睓妗?妗ゆ埦绀ら緵?
 int edx; //鐤辨报鑰?EDX, 榛╁睓妗?妗ゆ埦绀ら緵?
 int ebx; //鐤辨报鑰?EBX, 榛╁睓妗?妗ゆ埦绀ら緵?
 int esp; //鐤辨报鑰?ESP, 榛╁睓妗?妗ゆ埦绀ら緵?
 int ebp; //鐤辨报鑰?EBP, 榛╁睓妗?妗ゆ埦绀ら緵?
 int esi; //鐤辨报鑰?ESI, 榛╁睓妗?妗ゆ埦绀ら緵?
 int edi; //鐤辨报鑰?EDI, 榛╁睓妗?妗ゆ埦绀ら緵?

 _ptr_ return_address; //鍣ょ柋?蹇哥幃鐤ｈ湠, 榛╁睓妗?妗ゆ埦绀ら緵?

 FlagsRegister flags; //鐤辨报鑰?缍﹀殕閽? 榛╁睓妗?妗ゆ埦绀ら緵?
 // 娼嗭５ 铮电惃瑙?闀抽捊鐤ｇ妗婇捈鍥? 绀?闀辨粭灞﹂獏蹇勵搥妗?寰艰澗鎭?闀? (纾暢. delphi)
 // flags 绁涢┙?鐚佽灟 閾掔柋婧磋劜?璧?_dword_ 铚╅暉.


 // 瓒旈换椴５ Push 妗侀倠?鍥楀毌閽芥鐪?婧磋匠铚、 瑙愮埁绀?闀抽摓缇艰€︾枺 PUSH 娼嗭５ 瑙愮湚灏昏€?LoHook 韬炶祬
 // 闀?妗夐暠鏈︾彊蹇勯緵??瑙愮湚灏昏€遍搸 韬炶祬 绡戣湠鐪嶆€嗗睓鐪嶆硱 ?闀辩顙?WriteLoHook 妗?CreateLoHook
 // 鐤ｇ張灞?闀?铚?瑙愯澗鐤ｏ５ 绁涢┙?鐚佽灟 闀辨埦顙栫， ?鑰卞盎 ?闀辩顙?顟涢搵 瓒旈换椴?閽界枺榫涢簢?128 寰夎降鍥?
 // 闀?妗夐暠鏈︾彊蹇勯緵??瑙愮湚灏昏€遍搸 韬炶祬 绡戣湠鐪嶆€嗗睓鐪嶆硱 ?闀辩顙?WriteLoHookEx 妗?CreateLoHookEx
 // 顟涢摋 鐤ｇ張灞?绡戣湠纾€嗘鍣辫澃铮?闀抽搳鐜搷顝?闀?鎭圭彊蹇?WriteLoHookEx 妗?CreateLoHookEx.
